In [18]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt

In [16]:
# Add the Pandas  and os dependency
import pandas as pd
import os

cwd = os.getcwd()
print(cwd)


#Files to load
ride_data_to_load = os.path.join("..\Resources", "ride_data.csv")
print(ride_data_to_load)
city_data_to_load = os.path.join("..\Resources", "city_data.csv")
# Read the school data file and store it in a Pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(2)
# Read the CSV into a DataFrame
#ity_data_df = pd.read_csv(city_data_to_load)
#ity_data_df.head(2)

C:\Users\merin\Documents\GitHub\Class_work_02_09_python\PyBer_Analysis
..\Resources\ride_data.csv

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577

In [9]:
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(2)

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban

In [14]:

ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [30]:
city_data_df.dtypes

city_data_df.count()

print(len(city_data_df["type"].unique()))

city_data_df["type"].unique()

3

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [17]:

# Combine the data into a single dataset.
ride_city_data_df = pd.merge(ride_data_df, city_data_df, on=["city", "city"])
ride_city_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,Lake Jonathanshire,2019-04-07 20:51:11,31.25,4441251834598,5,Urban
2,Lake Jonathanshire,2019-03-09 23:45:55,19.89,2389495660448,5,Urban
3,Lake Jonathanshire,2019-04-07 18:09:21,24.28,7796805191168,5,Urban
4,Lake Jonathanshire,2019-01-02 14:14:50,13.89,424254840012,5,Urban
...,...,...,...,...,...,...
2370,West Heather,2019-04-18 19:33:12,46.60,3671003215967,4,Rural
2371,West Heather,2019-03-02 21:04:10,20.99,5766454453070,4,Rural
2372,West Heather,2019-03-06 20:06:51,48.11,2570548892682,4,Rural
2373,West Heather,2019-02-02 06:28:04,53.07,2462950442268,4,Rural
2374,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural

In [32]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

city_data_df["type"]=="Urban"

0       True
1       True
2       True
3       True
4       True
       ...
115    False
116    False
117    False
118    False
119    False
Name: type, Length: 120, dtype: bool

In [46]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df,on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()
#pyber_data_df[pyber_data_df["city"]=='Lake Jonathanshire']

NameError: name 'pyber_data1_df' is not defined